#+TITLE: MECH 467 Lab 3:
#+AUTHOR: Jasper Chan - 37467164 @@latex:\\@@ jasperchan515@gmail.com
#+SUBTITLE: Simulation of Contouring Performance in Coordinated Two Axis Motion

#+OPTIONS: title:nil toc:nil

#+LATEX_HEADER: \definecolor{bg}{rgb}{0.95,0.95,0.95}
#+LATEX_HEADER: \setminted{frame=single,bgcolor=bg,samepage=true}
#+LATEX_HEADER: \setlength{\parindent}{0pt}
#+LATEX_HEADER: \sisetup{per-mode=fraction}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{svg}
#+LATEX_HEADER: \usepackage{cancel}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{mathtools, nccmath}
#+LATEX_HEADER: \newcommand{\Lwrap}[1]{\left\{#1\right\}}
#+LATEX_HEADER: \newcommand{\Lagr}[1]{\mathcal{L}\Lwrap{#1}}
#+LATEX_HEADER: \newcommand{\Lagri}[1]{\mathcal{L}^{-1}\Lwrap{#1}}
#+LATEX_HEADER: \newcommand{\Ztrans}[1]{\mathcal{Z}\Lwrap{#1}}
#+LATEX_HEADER: \newcommand{\Ztransi}[1]{\mathcal{Z}^{-1}\Lwrap{#1}}
#+LATEX_HEADER: \newcommand{\ZOH}[1]{\text{ZOH}\left(#1\right)}
#+LATEX_HEADER: \DeclarePairedDelimiter{\ceil}{\lceil}{\rceil}
#+LATEX_HEADER: \makeatletter \AtBeginEnvironment{minted}{\dontdofcolorbox} \def\dontdofcolorbox{\renewcommand\fcolorbox[4][]{##4}} \makeatother

#+BEGIN_EXPORT latex
\makeatletter
\begin{titlepage}
\begin{center}
\vspace*{2in}
{\Large \@title \par}
\vspace{1in}
{\Large \@author \par}
\vspace{3in}
{\large \@date}
\end{center}
\end{titlepage}
\makeatother
#+END_EXPORT

#+BEGIN_EXPORT latex
\begin{abstract}
The purpose of this report is to analyze the performance of the XY table using the controllers and toolpaths developed in the prelab.
The controllers will be implemented on the real system, and the toolpath executed.
The position of the table will be recorded while the table is in operation.
The data can then be compared with data generated using the same set of controllers and toolpath via simulation.
\end{abstract}
#+END_EXPORT

\tableofcontents

#+begin_src elisp :session :exports none
(org-babel-tangle)
#+end_src

#+RESULTS:
| plot_cont_err_sb.m | plot_cont_err.m | plot_cont_err_internal.m | get_cont_err.m | plot_track_err.m | extract_sim_data.m | arc_move.m | linear_move.m | generic_move.m | acceleration.m | feedrate.m | displacement.m | get_disc_time_periods.m | get_time_periods.m | get_lli.m |

#+begin_src matlab :exports none :tangle get_lli.m
function lli = get_lli(G_ol, omega_c, pm)
    K_i = omega_c/10;
    integral_action = tf([1 K_i], [1 0]);
    % wout is in degrees
    [H, wout] = bode(G_ol, omega_c);
    phi = pm - (180 + wout);
    a = (sind(phi) + 1)/(1 - sind(phi));
    tau = 1/(omega_c *sqrt(a));
    K_tot = 1/H;
    K_comp = K_tot/sqrt(a);
    num = K_comp*[a*tau 1];
    den = [tau 1];
    C_comp = tf(num, den);
    lli = integral_action*C_comp;
end
#+end_src
#+begin_src matlab :exports none :tangle get_time_periods.m
function [T_1, T_2, T_3] = get_time_periods(L, A, D, f_c)
    T_2 = L/f_c - (1/(2*A) - 1/(2*D))*f_c;
    if T_2 < 0
        T_2 = 0;
        f_c = sqrt(2*A*D*L/(D - A));
    end
    T_1 = f_c/A;
    T_3 = -f_c/D;
end
#+end_src
#+begin_src matlab :exports none :tangle get_disc_time_periods.m
function [N_1, N_2, N_3, f_cp, Ap, Dp] = get_disc_time_periods(...
        T_1, T_2, T_3, L, T_i)
    N_1 = ceil(T_1/T_i);
    N_2 = ceil(T_2/T_i);
    N_3 = ceil(T_3/T_i);
    f_cp = 2*L/(T_i*(N_1 + 2*N_2 + N_3));
    Ap = f_cp/(T_i*N_1);
    Dp = -f_cp/(T_i*N_3);
end
#+end_src
#+begin_src matlab :exports none :tangle displacement.m
function l = displacement(N_1, N_2, N_3, f_cp, Ap, Dp, T_i)
    total = N_1 + N_2 + N_3;
    l = zeros(1, total);
    for k=1:total
        k_1 = min(k, N_1);
        k_2 = min(k - N_1, N_2);
        k_3 = min(k - (N_1 + N_2), N_3);
        l_1 = 0.5*Ap*(k_1*T_i)^2;
        l_2 = f_cp*(k_2*T_i) + l_1;
        l_3 = 0.5*Dp*(k_3*T_i)^2 + f_cp*(k_3*T_i) + l_2;
        if k <= N_1
            l(k) = l_1;
        elseif k <= N_1 + N_2
            l(k) = l_2;
        elseif k <= N_1 + N_2 + N_3
            l(k) = l_3;
    end
end
#+end_src
#+begin_src matlab :exports none :tangle feedrate.m
function f = feedrate(N_1, N_2, N_3, f_cp, Ap, Dp, T_i)
    total = N_1 + N_2 + N_3;
    f = zeros(1, total);
    for k=1:total
        f_1 = Ap*(k*T_i);
        f_2 = f_cp;
        f_3 = Dp*((k - (N_1 + N_2))*T_i) + f_cp;
        if k <= N_1
            f(k) = f_1;
        elseif k <= N_1 + N_2
            f(k) = f_2;
        elseif k <= N_1 + N_2 + N_3
            f(k) = f_3;
    end
end
#+end_src
#+begin_src matlab :exports none :tangle acceleration.m
function a = acceleration(N_1, N_2, N_3, f_cp, Ap, Dp, T_i)
    total = N_1 + N_2 + N_3;
    a = zeros(1, total);
    for k=1:total
        a_1 = Ap;
        a_2 = 0;
        a_3 = Dp;
        if k <= N_1
            a(k) = a_1;
        elseif k <= N_1 + N_2
            a(k) = a_2;
        elseif k <= N_1 + N_2 + N_3
            a(k) = a_3;
    end
end
#+end_src
#+begin_src matlab :exports none :tangle generic_move.m
function [l, f, a] = generic_move(L, A, D, f_c, T_i)
    [T_1, T_2, T_3] = get_time_periods(L, A, D, f_c);
    [N_1, N_2, N_3, f_cp, Ap, Dp] = get_disc_time_periods(T_1, T_2, T_3, L, T_i);
    l = displacement(N_1, N_2, N_3, f_cp, Ap, Dp, T_i);
    f = feedrate(N_1, N_2, N_3, f_cp, Ap, Dp, T_i);
    a = acceleration(N_1, N_2, N_3, f_cp, Ap, Dp, T_i);
end
#+end_src
#+begin_src matlab :exports none :tangle linear_move.m
% Implement G-code G0/G1 command, assume relative mode
function [x, y, dx, dy, ddx, ddy, l, f, a] = linear_move(...
        x_f, y_f, f_c, A, D, T_i)
    L = sqrt(x_f^2 + y_f^2);
    c_x = x_f/L;
    c_y = y_f/L;
    [l, f, a] = generic_move(L, A, D, f_c, T_i);
    x = c_x*l;
    dx = c_x*f;
    ddx = c_x*a;
    y = c_y*l;
    dy = c_y*f;
    ddy = c_y*a;
end
#+end_src
#+begin_src matlab :exports none :tangle arc_move.m
% Implement pseudo G-code G3 command, IJ form,
% Note: x_f and y_f are relative to current position
function [x, y, dx, dy, ddx, ddy, l, f, a] = arc_move(...
        x_f, y_f, I, J, f_c, A, D, T_i)
    R = sqrt(I^2 + J^2);
    R_f = sqrt((I - x_f)^2 + (J - y_f)^2);
    assert(R == R_f, 'Arc center not equidistant from start and end points');
    theta_0 = atan2(-J, -I);
    R_x1 = -I;
    R_y1 = -J;
    R_x2 = x_f - I;
    R_y2 = y_f - J;
    theta_1 = atan2(R_y1, R_x1)
    theta_2 = atan2(R_y2, R_x2)
    if theta_1 <= 0
        theta_1 = theta_1 + pi*2;
    end
    if theta_2 <= 0
        theta_2 = theta_2 + pi*2;
    end
    theta_3 = theta_1 - theta_2;
    if theta_3 <= 0
        theta_3 = theta_3 + pi*2;
    end
    L = theta_3*R;
    [l, f, a] = generic_move(L, A, D, f_c, T_i);
    theta = theta_0 + l/R;
    x = I + R.*cos(theta);
    dx = -f.*sin(theta);
    ddx = -a.*sin(theta) - 1/R.*f.^2.*cos(theta);
    y = J + R.*sin(theta);
    dy = f.*cos(theta);
    ddy = a.*cos(theta) - 1/R.*f.^2.*sin(theta);
end
#+end_src
#+begin_src matlab :exports none :tangle extract_sim_data.m
function [t, xr, xo, yr, yo] = extract_sim_data(out)
    t = out.simout.Time;
    d = out.simout.Data;
    xr = d(:,1);
    xo = d(:,2);
    yr = d(:,3);
    yo = d(:,4);
end
#+end_src

Note: when not specified, all units are SI without prefixes.
